package com.photon.photonchain.exception;

public enum ErrorCode {
    _10001,//非法合约
    _10002,//合约不合法，括号或引号不对等
    _10003,//合约不合法，合约不是以}结尾
    _10004,//{前面的字符不是字母数字下划线
    _10005,//(前面的字符不是字母数字下划线
    _10006,//)后面的字符不能是字母数字下划线
    _10007,//非法参数命名
    _10008,//变量写入不会以set开始
    _10009,//参数写入不标准
    _10010,//变量类型写入未定义
    _10011,//变量写入=不标准
    _10012,//事件名字重复
    _10013,//事件参数在定义中不存在
    _10014,//事件参数名称重复
    _10015,//方法名错误
    _10016,//方法参数名称重复
    _10017,//事件coin只是整数
    _10018,//事件参数中必须有一个为ptn代币
    _10019,//if条件不合法
    _10020,//命名非法，只能由字母数字下划线组成
    _10021,//不匹配的类型
    _10022,//事件名字重复
    _10023,//事件中逗号数量过多
    _10024,//事件中的参数顺序查找不到
    _10025,//事件coin不能大于10000
    _10026,//方法return错误
    _10027,//方法赋值等操作错误
    _10028,//赋值操作参数类型错误
    _10029,//错误的赋值运算
    _10030,//不匹配类型
    _10031,//返回关键字错误
    _10032,//投票方法不能存在return
    _10033,//赋值操作类型不匹配
    _10034,//赋值操作类型不匹配
    _10035,//赋值操作类型不匹配
    _10036,//代币精度只能为6-8
    _10037,//代币发行量只能为1000-100000000000的整数
    _10038,//当发行量大于或等于10000000000,单位不得超过7
    _10039,//数组越界
    _10040,//if条件判断有误
    _10041,//字符串比较只能等于和不等于
    _10042,//目前只支持单个类
    _10043,//数组内容默认字符串不需要写引号
    _10044,//if条件里面必须有一个常亮
    _10045,//,stop错误
    _20000;

    private int code;

    private ErrorCode() {
        this.code = Integer.valueOf(this.toString().substring(1));
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }
}
